tap "bahaaio/pomo"
tap "farion1231/ccswitch"
tap "hmbown/deepseek-tui"
tap "jundot/omlx", "https://github.com/jundot/omlx"
tap "siguremo/tap"
tap "steipete/tap"
tap "surge-downloader/tap"
tap "tw93/tap"
brew "aichat"
brew "aria2"
brew "bat"
brew "libdatrie"
brew "libthai"
brew "chafa"
brew "container"
brew "direnv"
brew "dotnet"
brew "dotnet@8"
brew "duti"
brew "eza"
brew "fastfetch"
brew "ffmpeg"
brew "fzf"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "jq"
brew "katago"
brew "lazygit"
brew "llama.cpp"
brew "neovim"
brew "nmap"
brew "ripgrep"
brew "opencode"
brew "openconnect"
brew "oxipng"
brew "pandoc"
brew "pipx"
brew "rclone"
brew "rsync"
brew "rust"
brew "starship"
brew "tealdeer"
brew "teleport"
brew "texlab"
brew "tig"
brew "tmux"
brew "typst"
brew "unison"
brew "unzip"
brew "uv"
brew "wget"
brew "xcodegen"
brew "xxh"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "hmbown/deepseek-tui/deepseek-tui"
brew "tw93/tap/mole"
cask "antigravity"
cask "blender"
cask "farion1231/ccswitch/cc-switch"
cask "codex"
cask "container"
cask "cursor"
cask "font-fira-code"
cask "font-maple-mono"
cask "font-maple-mono-nf"
cask "font-maple-mono-nf-cn"
cask "iina"
cask "input-source-pro"
cask "tw93/tap/kakuku"
cask "keka"
cask "llamabarn"
cask "localsend"
cask "mactex-no-gui"
cask "miniconda"
cask "notion"
cask "obs"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "bahaaio/pomo/pomo"
cask "qq"
cask "stats"
cask "steam"
cask "sublime-text"
cask "surge-downloader/tap/surge"
cask "telegram"
cask "tolaria"
cask "trae"
cask "typora"
cask "visual-studio-code"
cask "zed"
vscode "anthropic.claude-code"
vscode "james-yu.latex-workshop"
vscode "mathworks.language-matlab"
vscode "ms-azuretools.vscode-containers"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "rust-lang.rust-analyzer"
vscode "zhuangtongfa.material-theme"
cargo "fd-find"
